using SimpleAlgorithmsApp;
using System;
using System.Runtime.InteropServices;

namespace OOP_4Lab
{
    class Program
    {
        static void Main(string[] args)
        {
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негровм
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров// скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров


            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров

            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров

            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров// скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров// скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров// скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // скажи преподу что за такие задание его должны были ебать в жопу 50 негров
            // ес минус тваря йуху
            // ес минус тваря йуху
            // ес минус тваря йуху
            // ес минус тваря йуху
            // ес минус тваря йуху

            // ес минус тваря йуху
            // ес минус тваря йуху
            // ес минус тваря йуху
            // ес минус тваря йуху
            // ес минус тваря йуху
            // ес минус тваря йуху
            var ll = new LinkedList<int>();

            ll.Add(1);
            ll.Add(2);
            ll.Add(3);
            ll.Add(4);
            ll.Add(5);
            ll.Add(6); 
            ll.Add(7);

            var lll = new LinkedList<int>();

            lll.Add(1);
            lll.Add(2);
            lll.Add(3);
            lll.Add(4);
            lll.Add(5);
            lll.Add(6);
            lll.Add(7);

            if (ll == lll)
            {
                Console.WriteLine("да");
            }
            else
            {
                Console.WriteLine("net");
            }

            

            
        }
    }
}
